[{"contents":"## hey, I'm Ben 👋\r\n\r\nI'm a designer/frontend developer hybrid that loves to build great products with delightful interfaces.\r\n\r\nI'm fueled by the ever-evolving world of web technologies and thrive on turning ideas into reality through elegant code.\r\n\r\nI grew up in Suzhou, located in the eastern part of China, is a renowned city that blends modernity with rich historical and cultural heritage. Often referred to as the \"Venice of the East\".\r\n\r\nI currently reside in Melbourne, often hailed as the \"Cultural Capital\" of Australia, where the arts are celebrated in all their forms. The city boasts a vibrant and diverse cultural scene, offering a rich tapestry of creative expressions.\r\n\r\nOutside of work I’m obsessed with endurance sports and travelling with my family.\r\n\r\n## my skills\r\n\r\n✅ **Languages**: HTML5, CSS3, JavaScript (ES6+)\r\n\r\n✅ **Frameworks/Libraries**: React, Next.js\r\n\r\n✅ **Styling**: Sass, CSS Modules\r\n\r\n✅ **Version Control**: Git\r\n\r\n✅ **Responsive Design**: Mobile-first approach\r\n\r\n✅ **Build Tools**: Webpack\r\n\r\n✅ **Testing**: Jest\r\n\r\n✅ **CMS**: Sanity, WordPress\r\n\r\n✅ **UI/UX**: Wireframing, Prototyping\r\n\r\n✅ **Graphic Design**: Branding, Packaging, Print & Advertising\r\n\r\n✅ **3D**: Modelling, Rendering\r\n\r\n## what drives me\r\n\r\nAs a frontend developer and graphic designer, my greatest joy comes from crafting seamless and captivating user experiences. My mission is to design visually appealing and intuitive interfaces that engage and delight users. I am constantly eager to stay on top of emerging trends and best practices in web development, ensuring that my work remains at the cutting edge of modern design and functionality.\r\n\r\n## let's connect\r\n\r\nIf you're interested in collaborating on exciting projects or just want to talk tech, feel free to reach out to me:\r\n\r\n- Email: [bjmczhang@gmail.com](mailto:bjmczhang@gmail.com)\r\n- GitHub: [@bjmczhang](https://github.com/bjmczhang)\r\n- Portfolio: [bjmzhang](https://bjmczhang.com)\r\n- LinkedIn: [Benjamin Zhang](https://www.linkedin.com/in/benjamin-zhang-965359262/)\r\n\r\nLooking forward to connecting with fellow developers and creators! 🚀\r\n\r\n> _\"Stay hungry, stay foolish.\" - Steve Jobs_\r\n"}]